alplabai/gd32-bridge-firmware/hal/gd32/init.c
	/* Secure-element reset (SE_RST = PC13): promote it to a released-
     * level push-pull output FIRST, ahead of every other peripheral
     * bring-up below.  PC13 has no entry in `gpio_pad_map` (see
     * hal/gd32/gpio.c), so from reset until whichever statement first
     * touches it, it sits at its GPIO POR default -- ANALOG mode,
     * with the input buffer and both pull resistors disabled (UM
     * Rev1.2 p.270 §7.3.7): genuinely floating, not merely un-pulled.
     * The TRNG bring-up a few statements below this used to run first
     * and can alone spend up to ~1 ms in that state (hal/gd32/trng.c)
     * -- but that is NOT the dominant exposure: the pre-main() SramInit
     * loop floats PC13 for ~20-25 ms before bridge_hw_init() is ever
     * called (see the header comment in hal/gd32/se_reset.c for the
     * derivation).  That window is not fixable by moving this call any
     * earlier -- there is nowhere earlier in this backend to move it
     * to -- so gh#61 stays open after this reorder; this promotion
     * only bounds boot from main() onward and closes the separate
     * sub-microsecond OCTL-preload-vs-mode-promote gap inside
     * se_reset_configure() itself.  Needs only its own GPIOC clock;
     * the bulk AHB2 enable just below
     * re-enables it harmlessly for the rest of port C's pads. */
	rcu_periph_clock_enable(RCU_GPIOC);
	se_reset_init();

	/* Enable AHB2 clocks for every GPIO port the pad map references.
     * The chip's RCU keeps unused GPIO ports clock-gated to save
     * power; we enable A..F unconditionally because the E1M IO map
     * spans those ports.  Port G isn't referenced by any pad. */
	rcu_periph_clock_enable(RCU_GPIOA);
	rcu_periph_clock_enable(RCU_GPIOB);
	rcu_periph_clock_enable(RCU_GPIOC);
	rcu_periph_clock_enable(RCU_GPIOD);
	rcu_periph_clock_enable(RCU_GPIOE);
	rcu_periph_clock_enable(RCU_GPIOF);

	/* Configure every entry in `gpio_pad_map` as INPUT + PULL_UP.
     * Safe default per the GPIO direction policy: no driven
     * contention with whatever the board might pull / drive on
     * those pads.  bridge_hw_gpio_write() promotes individual
     * pads to OUTPUT on demand. */
	for (size_t i = 0; i < GPIO_PAD_MAP_COUNT; ++i) {
		gpio_mode_set(
		    gpio_pad_map[i].periph, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, gpio_pad_map[i].pin);
		gpio_is_output[i] = false;
	}

	/* TRNG bring-up: configure + enable only.  The NIST pipeline's
     * first conditioned word can lag past any boot-time wait we are
     * willing to spin; readiness is promoted lazily by the first
     * TRNG_READ's short DRDY poll (by which point the host's boot
     * settle has given the analog source seconds, not milliseconds). */
	trng_started = trng_start();
	if (trng_started) {
		/* Boot-time readiness grace: the transports aren't up yet, so
         * spending a few milliseconds here is free and spares the
         * FIRST host TRNG_READ the one-time conditioning latency
         * (observed on the functional tier: the inaugural read paid
         * the promotion and answered STATUS_IO once).  Bounded; the
         * lazy per-read path remains the safety net. */
		for (unsigned round = 0u; round < 8u && trng_started && !trng_ready; ++round) {
			(void)trng_poll_ready();
		}
	}

	/* TMU clock enable.  Per-op configuration happens in
     * bridge_hw_tmu_compute because the mode + I/O width vary per
     * call. */
	rcu_periph_clock_enable(RCU_TMU);

	/* DAC bring-up.  Two channels per `dac_channels[]`:
     *   ch0 -> DAC0_OUT0 -> PA4
     *   ch1 -> DAC1_OUT0 -> PA6
     * Configure both pads as analog (GPIOA clock was enabled
     * above for the IO pad map), enable each DAC peripheral in
     * NORMAL_PIN_BUFFON mode so the output drives the pad
     * through the chip's built-in buffer. */
	gpio_mode_set(GPIOA, GPIO_MODE_ANALOG, GPIO_PUPD_NONE, GPIO_PIN_4 | GPIO_PIN_6);
	rcu_periph_clock_enable(RCU_DAC0);
	rcu_periph_clock_enable(RCU_DAC1);
	for (size_t i = 0; i < DAC_CHANNEL_COUNT; ++i) {
		dac_deinit(dac_channels[i].periph);
		dac_trigger_disable(dac_channels[i].periph, dac_channels[i].out);
		dac_wave_mode_config(dac_channels[i].periph, dac_channels[i].out, DAC_WAVE_DISABLE);
		dac_mode_config(dac_channels[i].periph, dac_channels[i].out, NORMAL_PIN_BUFFON);
		dac_enable(dac_channels[i].periph, dac_channels[i].out);
	}

	/* Free-running counter: enable the Cortex-M33 DWT cycle counter.
     * TRCENA in CoreDebug->DEMCR gates the entire DWT/ITM trace block;
     * setting CYCCNTENA in DWT->CTRL starts the 32-bit free-running
     * counter at the core clock rate (216 MHz on the GD32G553 in the
     * stock clock config -> ~19.9 s wrap, ~4.63 ns LSB).  The counter
     * is the source for bridge_hw_counter_read(). */
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CYCCNT = 0u;
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

	/* PWM bring-up: configure the 8 PWM pads as alt-function outputs,
     * enable TIMER0 + TIMER7 clocks, run the per-timer + per-channel
     * init.  After this the timers are running at 1 us tick with 0%
     * duty on every channel; bridge_hw_pwm_set programs both the
     * channel compare register and the timer ARR per call. */
	for (size_t i = 0; i < PWM_CHANNEL_COUNT; ++i) {
		const gd32_pwm_ch_t *ch = &pwm_channels[i];
		gpio_mode_set(ch->gpio_port, GPIO_MODE_AF, GPIO_PUPD_NONE, ch->gpio_pin);
		gpio_output_options_set(ch->gpio_port, GPIO_OTYPE_PP, GPIO_OSPEED_12MHZ, ch->gpio_pin);
		gpio_af_set(ch->gpio_port, ch->gpio_af, ch->gpio_pin);
	}
	rcu_periph_clock_enable(RCU_TIMER0);
	rcu_periph_clock_enable(RCU_TIMER7);
	pwm_timer_init(TIMER0);
	pwm_timer_init(TIMER7);
	for (size_t i = 0; i < PWM_CHANNEL_COUNT; ++i) {
		pwm_channel_init(&pwm_channels[i]);
	}

	/* Analog REFERENCE bring-up -- MUST precede any ADC/DAC use.
     *
     * On this module revision the converters' reference node is served
     * by the GD32's ON-CHIP reference buffer -- there is no external
     * reference source (hardware rationale in the internal bench
     * notes).  At reset VREF_CS defaults to 0x02 (HIPM high-impedance):
     * the buffer is parked, the reference node is undriven, and EVERY
     * ADC channel + both DACs reference a dead node -- the entire
     * analog subsystem read garbage/zero (silently, since the old ADC
     * assertions were ceiling-only and DAC_GET echoes the digital hold
     * register, not the pad).
     *
     * Fix: enable the buffer.  Its three targets (2.048 / 2.5 /
     * 2.9 V) all exceed the module's 1.8 V VDDA, so the buffer
     * regulates as high as the rail allows (~VDDA); the lowest
     * target (2.048 V) is the closest fit and least headroom stress.
     * Bench-proven: VREFEN -> VREFRDY sets, and a DAC->ADC copper
     * loopback then tracks 1:1 (DAC 2730 -> ADC 2730).  The reference
     * cancels ratiometrically in that loop, so correctness is
     * independent of the exact railed reference value; the absolute mV
     * scale (ADC_VREF_MV / DAC_VREF_MV) tracks the railed VDDA.
     *
     * VREFRDY wait is BOUNDED (boot-time, no SysTick yet): a spin
     * cap, not an unbounded poll -- a never-ready buffer must not hang
     * the bridge before the transports come online. */
	rcu_periph_clock_enable(RCU_VREF);
	vref_voltage_select(VREF_VOLTAGE_SEL_2_048V); /* lowest target = closest under VDDA */
	/* CLEAR HIPM first.  VREF_CS resets to 0x02 (HIPM high-impedance),
     * and the SPL's vref_enable() is a read-modify-write that only
     * sets VREFEN -- it PRESERVES the reset HIPM bit, leaving the
     * buffer output high-Z so VREFRDY never sets and the reference
     * node stays dead (silicon-caught 2026-06-05: VREF_CS read 0x03 =
     * VREFEN|HIPM, ADC still zero).  HIPM must be cleared for the
     * buffer to drive the node. */
	vref_high_impedance_mode_disable();
	vref_enable();
	for (uint32_t vr = 0u; vr < 100000u; ++vr) {
		if (vref_status_get() == SET) break; /* VREFRDY -- buffer locked */
	}
	/* Latch the verdict.  A buffer that never locked leaves vref_ok
     * false and every ADC/DAC op answers IO instead of serving
     * garbage referenced to a dead node (the exact silent failure the
     * VREF bring-up exists to cure).  vref_ready_check() re-probes on
     * each analog op, so a late lock self-promotes. */
	vref_ok = (vref_status_get() == SET);

	/* ADC bring-up: configure 8 pads as analog, enable all four ADC
     * peripheral clocks, run the per-peripheral init.  Calibration
     * inside adc_periph_init now runs against a LIVE reference (it
     * previously self-calibrated against the undriven reference node,
     * baking in a bogus offset); the VREF bring-up above is the
     * prerequisite that makes that calibration meaningful. */
	for (size_t i = 0; i < ADC_CHANNEL_MAP_COUNT; ++i) {
		gpio_mode_set(adc_channels_map[i].gpio_port,
		              GPIO_MODE_ANALOG,
		              GPIO_PUPD_NONE,
		              adc_channels_map[i].gpio_pin);
	}
	rcu_periph_clock_enable(RCU_ADC0);
	rcu_periph_clock_enable(RCU_ADC1);
	rcu_periph_clock_enable(RCU_ADC2);
	rcu_periph_clock_enable(RCU_ADC3);
	/* Boot-time calibration result intentionally not latched: a
     * converter that fails here is also the converter every request-
     * path op re-times against (the read path's bounded EOC wait +
     * self-heal), so the failure surfaces loudly on first use instead
     * of wedging boot. */
	(void)adc_periph_init(ADC0);
	(void)adc_periph_init(ADC1);
	(void)adc_periph_init(ADC2);
	(void)adc_periph_init(ADC3);
	for (size_t i = 0; i < ADC_CHANNEL_MAP_COUNT; ++i) {
		adc_sample_cycles_cache[i]    = ADC_DEFAULT_SAMPLE_CYCLES;
		adc_resolution_bits_cache[i]  = ADC_RES_BITS_DEFAULT;
		adc_oversample_ratio_cache[i] = 1u; /* no oversampling */
	}

	/* Quadrature encoder bring-up: TIMER1..4 host the four E1M
     * encoder pairs.  Each timer uses its CH0 + CH1 input-capture
     * units as the X / Y quadrature inputs (decoder mode 2 -> X4). */
	rcu_periph_clock_enable(RCU_TIMER1);
	rcu_periph_clock_enable(RCU_TIMER2);
	rcu_periph_clock_enable(RCU_TIMER3);
	rcu_periph_clock_enable(RCU_TIMER4);
	for (size_t i = 0; i < QENC_CHANNEL_COUNT; ++i) {
		qenc_channel_init(&qenc_map[i]);
	}
}

